app/controllers/books_controller.rb

  def index
    @books = Book.all
---
SELECT `books`.* FROM `books`

  def show
    @book = Book.find(params[:id])
    @first_page = Page.where(:book_id=>params[:id]).first
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT `pages`.* FROM `pages` WHERE `pages`.`book_id` IS NULL LIMIT 1

  def edit
    @book = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1

  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save
---
INSERT INTO `books` (`name`, `description`, `cover_file`, `created_at`, `updated_at`) VALUES ('Phineas and Ferb', 'Phineas and Ferb blah blah blah', 'fe85439684c6cdabf357e261ac71591d49cd74e7228652.png', '2011-09-01 03:57:17', '2011-09-01 03:57:17')

  def destroy
    @book = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1