app/controllers/comments_controller.rb

SELECT `comments`.* FROM `comments`
---
  def index
    @comments = Comment.all

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
---
  def show
    @comment = Comment.find(params[:id])

SELECT COUNT(*) FROM `comments` WHERE `comments`.`page_id` = 4
SELECT `comments`.* FROM `comments` WHERE `comments`.`page_id` = 4 ORDER BY id DESC LIMIT 10 OFFSET 0
SELECT `pages`.* FROM `pages` WHERE (id = 5 ORDER ID DESC) LIMIT 1
INSERT INTO `comments` (`comment`, `created_at`, `page_id`, `updated_at`, `user_id`) VALUES ('<p>Me <em>gusta</em> que <em>Click N\' Slide </em>tiene TinyMCE</p>', '2011-09-07 09:04:35', 4, '2011-09-07 09:04:35', NULL)
---
  def create
    params[:page] = 1 #Must always be 1 to show new comment
    params[:comment][:comment] = Sanitize.clean(params[:comment][:comment], Sanitize::Config::RELAXED)
    @comment = Comment.new
    @newComment = Comment.new(params[:comment])
    @page = Page.where("id = ?", @newComment.page_id).first()
    @comments = @page.comments.page(params[:page]).per(10)

    respond_to do |format|
      if @newComment.save

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy