app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT `pages`.* FROM `pages`

  def show
    params[:page] ||= 1
    @page = Page.find(params[:id])
    @comment = Comment.new(:page_id=>@page.id)
    @comments = @page.comments.page(params[:page]).per(10)
---
SELECT `pages`.* FROM `pages` WHERE (`pages`.book_id = 1) AND (id < 5) ORDER BY id desc LIMIT 1
SELECT COUNT(*) FROM `comments` WHERE `comments`.`page_id` = 2
SELECT `comments`.* FROM `comments` WHERE `comments`.`page_id` = 2 ORDER BY id DESC LIMIT 10 OFFSET 0

  def edit
    @page = Page.find(params[:id])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 5 LIMIT 1

  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save
---
INSERT INTO `pages` (`translation`, `created_at`, `updated_at`, `file`, `book_id`) VALUES ('no hay traduccion', '2011-09-01 04:12:30', '2011-09-01 04:12:30', '1306650584_recien_casados___color_by_deathseventyone-d3gn2ar.png', NULL)

  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 5 LIMIT 1
UPDATE `pages` SET `file` = 'clicknslide.png', `updated_at` = '2011-09-01 14:50:54' WHERE `pages`.`id` = 5

  def destroy
    @page = Page.find(params[:id])
    @page.destroy
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1
DELETE FROM `pages` WHERE `pages`.`id` = 1