app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    respond_to do |format|
      format.html{
        if @user.save
---
INSERT INTO `users` (`created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `firstname`, `last_sign_in_at`, `last_sign_in_ip`, `lastname`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `role`, `sign_in_count`, `updated_at`, `username`) VALUES ('2011-09-07 07:19:55', NULL, NULL, 'plow_dawg@msn.com', '$2a$10$vXGYfp3qzaIdRznj6G3BoeDr6PVKB2TkHWs3WJZ8tObj7HKvWQniO', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2011-09-07 07:19:55', 'admin')